
/**
 *
 *
 * Задание №1
 *
 * Задание выполняйте в проекте
 *
 * 05_ArraysAndCollections/homework_5.1/ReverseArray.
 *
 * Что нужно сделать
 *
 * В классе ReverseArray реализуйте метод reverse(), который должен поменять
 * порядок элементов на обратный и вернуть тот же самый массив.
 * Проверьте ваш код с помощью тестов.
 *  Пример
 *
 * Первоначальный массив: [“a”, “b”, “c”, “d”].
 *
 * Массив с элементами в обратном порядке: [“d”, “c”, “b”, “a”].
 *
 *
 */


public class Main {

    public static void main(String[] args) {
        String line = "Каждый охотник желает знать, где сидит фазан";
    }
}
